Tekla.Structures.ModelInternal.dotRebarLengthAdjustment_t
The rebar length adjustment struct.

Tekla.Structures.ModelInternal.dotRebarLengthAdjustment_t.AdjustmentType
The adjustment type.

Tekla.Structures.ModelInternal.dotRebarLengthAdjustment_t.AdjustmentLength
The adjustment length.